// src/App.jsx
import React from 'react';
import ScheduleTable from './components/ScheduleTable';

const App = () => {
    const names = [
        'Зацепин Е. П.', 'Бойчевский А. В.', 'Бурлаков А. В.', 'Довженко С. В.', 
        'Картель А. Ю.', 'Телегина О. А.', 'Телегин В. В.', 'Казмалы А. С.', 
        'Лаврухин Р. В.', 'Шпиганович А. А.', 'Шурыгин Ю. А.', 'Кудрявцев А. Е.', 
        'Каверин Е. Ю.', 'Челядин В. Л.', 'Корченова Т. А.', 'Рублев Д. А.', 
        'Гаврилова О. В.', 'Медведев С. Е.', 'Егоров А. В.', 'Симонов Д. А.', 
        'Ловчий В. Р.', 'Мамонтов А. Н.', 'Шпиганович А. Н.', 'Павленко И. А.', 
        'Сороченко П. А.', 'Кривоносов'
    ];

    const days = [
        'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'
    ];

    const times = [
        '8:00-9:30', '9:40-11:10', '11:20-12:50', '13:20-14:50', 
        '15:00-16:30', '16:40-18:10', '18:35-20:05', '20:15-21:45'
    ];

    return (
        <div>
            <h1>Расписание</h1>
            <ScheduleTable names={names} days={days} times={times} />
        </div>
    );
};

export default App;
